---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayArray.Clear
source: html/332dfde5-13cb-6b29-025e-654367a8fc2b.htm
---
# Autodesk.Revit.DB.ReferenceArrayArray.Clear Method

Removes every ReferenceArray from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```